'use strict';



var txt = `א בראשית, ברא אלוהים, את השמיים, ואת הארץ.  ב והארץ, הייתה תוהו ובוהו, וחושך, על-פני תהום; ורוח אלוהים, מרחפת על-פני המים.  ג ויאמר אלוהים, יהי אור; ויהי-אור.  ד וירא אלוהים את-האור, כי-טוב; ויבדל אלוהים, בין האור ובין החושך.  ה ויקרא אלוהים לאור יום, ולחושך קרא לילה; ויהי-ערב ויהי-בוקר, יום אחד.  {פ}

ו ויאמר אלוהים, יהי רקיע בתוך המים, ויהי מבדיל, בין מים למים.  ז ויעש אלוהים, את-הרקיע, ויבדל בין המים אשר מתחת לרקיע, ובין המים אשר מעל לרקיע; ויהי-כן.  ח ויקרא אלוהים לרקיע, שמיים; ויהי-ערב ויהי-בוקר, יום שני.  {פ}

ט ויאמר אלוהים, ייקוו המים מתחת השמיים אל-מקום אחד, ותיראה, היבשה; ויהי-כן.  י ויקרא אלוהים ליבשה ארץ, ולמקוה המים קרא ימים; וירא אלוהים, כי-טוב.  יא ויאמר אלוהים, תדשא הארץ דשא עשב מזריע זרע, עץ פרי עושה פרי למינו, אשר זרעו-בו על-הארץ; ויהי-כן.  יב ותוצא הארץ דשא עשב מזריע זרע, למינהו, ועץ עושה-פרי אשר זרעו-בו, למינהו; וירא אלוהים, כי-טוב.  יג ויהי-ערב ויהי-בוקר, יום שלישי.  {פ}

יד ויאמר אלוהים, יהי מאורות ברקיע השמיים, להבדיל, בין היום ובין הלילה; והיו לאותות ולמועדים, ולימים ושנים.  טו והיו למאורות ברקיע השמיים, להאיר על-הארץ; ויהי-כן.  טז ויעש אלוהים, את-שני המאורות הגדולים:  את-המאור הגדול, לממשלת היום, ואת-המאור הקטון לממשלת הלילה, ואת הכוכבים.  יז וייתן אותם אלוהים, ברקיע השמיים, להאיר, על-הארץ.  יח ולמשול, ביום ובלילה, ולהבדיל, בין האור ובין החושך; וירא אלוהים, כי-טוב.  יט ויהי-ערב ויהי-בוקר, יום רביעי.  {פ}

כ ויאמר אלוהים--ישרצו המים, שרץ נפש חיה; ועוף יעופף על-הארץ, על-פני רקיע השמיים.  כא ויברא אלוהים, את-התנינים הגדולים; ואת כל-נפש החיה הרומשת אשר שרצו המים למיניהם, ואת כל-עוף כנף למינהו, וירא אלוהים, כי-טוב.  כב ויברך אותם אלוהים, לאמור:  פרו ורבו, ומלאו את-המים בימים, והעוף, יירב בארץ.  כג ויהי-ערב ויהי-בוקר, יום חמישי.  {פ}

כד ויאמר אלוהים, תוצא הארץ נפש חיה למינה, בהמה ורמש וחיתו-ארץ, למינה; ויהי-כן.  כה ויעש אלוהים את-חית הארץ למינה, ואת-הבהמה למינה, ואת כל-רמש האדמה, למינהו; וירא אלוהים, כי-טוב.  כו ויאמר אלוהים, נעשה אדם בצלמנו כדמותנו; וירדו בדגת הים ובעוף השמיים, ובבהמה ובכל-הארץ, ובכל-הרמש, הרומש על-הארץ.  כז ויברא אלוהים את-האדם בצלמו, בצלם אלוהים ברא אותו:  זכר ונקבה, ברא אותם.  כח ויברך אותם, אלוהים, ויאמר להם אלוהים פרו ורבו ומלאו את-הארץ, וכבשוה; ורדו בדגת הים, ובעוף השמיים, ובכל-חיה, הרומשת על-הארץ.  כט ויאמר אלוהים, הנה נתתי לכם את-כל-עשב זורע זרע אשר על-פני כל-הארץ, ואת-כל-העץ אשר-בו פרי-עץ, זורע זרע:  לכם יהיה, לאוכלה.  ל ולכל-חית הארץ ולכל-עוף השמיים ולכול רומש על-הארץ, אשר-בו נפש חיה, את-כל-ירק עשב, לאוכלה; ויהי-כן.  לא וירא אלוהים את-כל-אשר עשה, והנה-טוב מאוד; ויהי-ערב ויהי-בוקר, יום השישי.  {פ}`

export const pasukService = {
    txt
}

makePsukim();

function makePsukim() {
    let arrFromTxt = Array.from(txt)
    let pasuks = []
    let endPos = 2;
    for (let i = 0; i < txt.length; i++) {
        if (txt.charAt(i) === '{') txt.slice(i, i +3)
        if (txt.charAt(i) === '.') {
            let pasukTxt = txt.slice(endPos, i)
            let pasukName = txt.charAt(endPos -  2)
            if (txt.charAt(endPos - 1) !== ' ') pasukName += txt.charAt(endPos - 1)

            console.log(pasukName, pasukTxt);
            

            endPos = i + 4
        }
        
    }
}